bouchons/test-fonctionnel/Tests de stabilisation/Request_Relais_GS_.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri" xmlns:acsb="http://www.ifopt.org.uk/acsb">

   <soapenv:Header/>

   <soapenv:Body>

      <wsdl:GetSiriService>

         <Request>

            <siri:RequestTimestamp>2016-01-19T10:51:57.000+01:00</siri:RequestTimestamp>

            <siri:RequestorRef>RELAIS</siri:RequestorRef>

            <siri:MessageIdentifier>RELAIS:Message::1:LOC</siri:MessageIdentifier>

           

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::2:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:42016:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::3:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:8106:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::4:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:41532:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::5:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:22911:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::6:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:22942:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::7:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:22913:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

        

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::8:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:34695:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::9:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:40918:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::10:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:28381:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

 

<siri:StopMonitoringRequest version="2.0:FR-IDF-2.4">

               <siri:RequestTimestamp>2016-01-11T10:51:57.000+01:00</siri:RequestTimestamp>

                        <siri:MessageIdentifier>RELAIS:Message::11:LOC</siri:MessageIdentifier>

                        <siri:MonitoringRef>STIF:StopPoint:Q:28894:</siri:MonitoringRef>

            </siri:StopMonitoringRequest>

 

       

 

</Request>

      </wsdl:GetSiriService>

   </soapenv:Body>

</soapenv:Envelope>
